#3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
#Для n = 6: [2, 2, 2, 2, 2, 3] -> 13
sum=0
n=int(input('Введите число: '))
for i in range(n):
    sum+=round((1+1/(i+1))**(i+1))
    print(round((1+1/(i+1))**(i+1)), end=', ')
print('->',sum)